
// Функция - Получить данные для COMСоединения
//
// Параметры:
//  ИнформационнаяБаза	 - СправочникСсылка.ИнформационнаяБаза - информационная база, к которой производится подключение
// 
// Возвращаемое значение:
//  Структура - структура данных, необходимых для подключения к информационной базе
//
Функция ПолучитьДанныеДляCOMСоединения(ИнформационнаяБаза) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("SQL");
	Структура.Вставить("ИмяСервера");
	Структура.Вставить("Порт");
	Структура.Вставить("ИмяБазы");
	Структура.Вставить("ВерсияПлатформы"	, ИнформационнаяБаза.Платформа);
	Структура.Вставить("Пользователь"		, Константы.АдминистраторИБЛогин.Получить());
	Структура.Вставить("Пароль"				, Константы.АдминистраторИБПароль.Получить());
	Структура.SQL = ИнформационнаяБаза.SQL;
	
	Если ИнформационнаяБаза.SQL Тогда
		Структура.ИмяСервера = ИнформационнаяБаза.Сервер;
		Структура.ИмяБазы = ИнформационнаяБаза.ИмяФайла;
		Структура.Порт = ИнформационнаяБаза.Сервер.Порт;
	Иначе
		Структура.ИмяСервера = ИнформационнаяБаза.Адрес;
		Структура.ИмяБазы = "";
	КонецЕсли;
	
	Возврат Структура;
КонецФункции