
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для каждого ИнформационнаяБаза Из ПараметрКоманды Цикл
		ПараметрыЗапускаИнформационнойБазы = ОбщегоНазначенияВызовСервера.ПолучитьПараметрыЗапускаИнформационнойБазы(ИнформационнаяБаза);
		
		ВерсияПлатформы	= ПараметрыЗапускаИнформационнойБазы.ВерсияПлатформы;
		Сервер			= ПараметрыЗапускаИнформационнойБазы.Сервер;
		ИмяБазы			= ПараметрыЗапускаИнформационнойБазы.ИмяФайла;
		Логин			= ПараметрыЗапускаИнформационнойБазы.Логин;
		Пароль			= ПараметрыЗапускаИнформационнойБазы.Пароль;
		ФайлЛогов		= "\\192.168.100.9\Exchange\Update_1c\log\file_db__log_" + ИнформационнаяБаза + ".txt";
		КудаВыгружать	= "/DumpIB\\192.168.100.9\Exchange\Update_1c\update_backup\" + ИнформационнаяБаза + ".dt";
		КодРазрешения	= "/uc 14429";
		
		ТекстКоманды = """C:\Program Files\1cv8\" + ВерсияПлатформы + "\bin\1cv8.exe"" " + "CONFIG" + " /S " + Сервер + "\" + ИмяБазы + " /N" + Логин + " /P" + Пароль + " " + КудаВыгружать  + " " + КодРазрешения+ " /Out " + ФайлЛогов + Символы.ПС;
		
		ЗапуститьПриложение(ТекстКоманды);
	КонецЦикла;
	
КонецПроцедуры
