
// Функция - Получить данные для COMСоединения
//
// Параметры:
//  ИнформационнаяБаза	 - СправочникСсылка.ИнформационнаяБаза - информационная база, к которой производится подключение
// 
// Возвращаемое значение:
//  COMОбъект - com объект с подключением к информационной базе
//
Функция ВыполнитьПодключениеКБазе(ИнформационнаяБаза) Экспорт
	
	ДанныеПодключения = Справочники.ИнформационныеБазы.ПолучитьДанныеДляCOMСоединения(ИнформационнаяБаза);

	Если ДанныеПодключения.ВерсияПлатформы = ПредопределенноеЗначение("Перечисление.Платформы.Версия83") Тогда 
		V8 = Новый COMОбъект("V83.COMConnector");
	Иначе 
		//V8 = Новый COMОбъект("V82.COMConnector");
	КонецЕсли;
	
	СтрокаПодключения = "";
	Если НЕ ДанныеПодключения.Файловая Тогда
		СтрокаПодключения = "srvr=""" + ДанныеПодключения.ИмяСервера + ":" + ДанныеПодключения.Порт + """; ref=""" + ДанныеПодключения.ИмяБазы + """; usr=""" + ДанныеПодключения.Пользователь + """; pwd=""" + ДанныеПодключения.Пароль + """;";
	Иначе
		СтрокаПодключения = "File=""" + ДанныеПодключения.ИмяСервера + """; usr=""" + ДанныеПодключения.Пользователь + """; pwd=""" + ДанныеПодключения.Пароль + """;";
	КонецЕсли;

	Попытка
		Подключение = V8.Connect(СтрокаПодключения);
	Исключение
		Подключение = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось подкюлчиться к информационной базе: " + ИнформационнаяБаза + ". Ошибка: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Возврат Подключение;
КонецФункции
