
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПароль = Параметры.ТекущийПароль;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(НовыйПароль);
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНаСервере(НовыйПароль)
	//Для каждой информационной базы, необходимо изменить пароль
	//Подключамся по текущему паролу и просто меняем
	БазыВыборка = Справочники.ИнформационныеБазы.Выбрать();
	Пока БазыВыборка.Следующий() Цикл
		ИнформационнаяБаза = БазыВыборка.Ссылка;
		
		Подключение = ОбщегоНазначенияКлиентСервер.ВыполнитьПодключениеКБазе(ИнформационнаяБаза);
		АдминистраторИБ = Подключение.ПользователиИнформационнойБазы.НайтиПоИмени("Администратор");
		Если АдминистраторИБ = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найден администратор ИБ: " + ИнформационнаяБаза;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		АдминистраторИБ.Пароль = НовыйПароль;
		АдминистраторИБ.Записать();
		Константы.АдминистраторИБПароль.Установить(НовыйПароль);
	КонецЦикла;
КонецПроцедуры
