
//&НаКлиенте
//Процедура ВыполнитьПослеОтветаНаВопрос(Результат, ДопПараметры) Экспорт 

//	НужныеДанные = ДопПараметры.НужныеДанные;
//	ТекущиеДанные = СобратьДанныеДляПодключенияНаСервере(НужныеДанные);
//	Если Результат = КодВозвратаДиалога.Да Тогда 
//		//СтандартнаяОбработка = Ложь;
//		КомандаДляПодключения = СписокВыборНаСервере(ТекущиеДанные);
//		ЗапуститьПриложение(КомандаДляПодключения);
//		Возврат;
//	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
//		Возврат;
//	Иначе 
//		//СтандартнаяОбработка = Ложь;
//		Возврат;
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	Если ПроверкаГруппы(ВыбраннаяСтрока) Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	СтандартнаяОбработка = Ложь;
//	ДопПараметры = Новый Структура("НужныеДанные", Элемент.ТекущиеДанные);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеОтветаНаВопрос", ЭтотОбъект, ДопПараметры);
//	ПоказатьВопрос(ОписаниеОповещения, "Да - Подключиться, Нет - Редактировать", РежимДиалогаВопрос.ДаНетОтмена, 60);
//	
//	//Ответ = Вопрос("Да - Подключиться, Нет - Редактировать", РежимДиалогаВопрос.ДаНетОтмена, 60);
//	
//	//НужныеДанные = Элемент.ТекущиеДанные;
//	//ТекущиеДанные = СобратьДанныеДляПодключенияНаСервере(НужныеДанные);
//	//Если Ответ = КодВозвратаДиалога.Да Тогда 
//	//	СтандартнаяОбработка = Ложь;
//	//	КомандаДляПодключения = СписокВыборНаСервере(ТекущиеДанные);
//	//	ЗапуститьПриложение(КомандаДляПодключения);
//	//	Возврат;
//	//ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
//	//	Возврат;
//	//Иначе 
//	//	СтандартнаяОбработка = Ложь;
//	//	Возврат;
//	//КонецЕсли;
//	
//	////--------------------Открытие диалога ДаНетОтмена без применения модальных окон
//	//ОписаниеОповещения = Новый ОписаниеОповещения("ВводТекстаЗаврешение", ЭтаФорма);
//	//ОткрытьФорму("Справочник.Пользователи.Форма.ФормаДаНетОтмена",,,,,,ОписаниеОповещения);
//	////--------------------
//КонецПроцедуры

//&НаСервере
//Функция СписокВыборНаСервере(ТекущиеДанные)
//	Строка = Подключиться.ПодключитьсяКУдаленномуКомпьютеру(ТекущиеДанные);
//	Возврат Строка;
//КонецФункции

//&НаСервере
//Функция  ПроверкаГруппы(Стр)
//	Возврат Стр.ЭтоГруппа;
//КонецФункции

//&НаСервере
//Функция СобратьДанныеДляПодключенияНаСервере(НужныеДанные) 
//ТекДанные = ОбщиеФункции.СобратьДанныеДляПодключения(НужныеДанные);
//Возврат ТекДанные;
//КонецФункции
