
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = Константы.АдминистраторИБЛогин.Получить();
	Пароль = Константы.АдминистраторИБПароль.Получить();
	УстановкаСнятиеБлокировки = Параметры.УстановкаСнятиеБлокировки;
	Для каждого ИнфБаза Из Параметры.МассивБаз Цикл
		
		Если ИнфБаза.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ОбрабатываемыеБазы.Добавить();
		НоваяСтрока.База = ИнфБаза;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБлокировку(Команда)
	ПараметрыЗакрытия = Новый Структура("Выполнена", Ложь);
	Попытка
		УстановитьСнятьБлокировку();
		ПараметрыЗакрытия.Выполнена = Истина;
	Исключение
		ТекстОшибки = "" + ОписаниеОшибки();
		ПараметрыЗакрытия.Вставить("Ошибка", ТекстОшибки);
	КонецПопытки;
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьБлокировку()
	ТаблицаБаз = ДанныеФормыВЗначение(ОбрабатываемыеБазы, Тип("ТаблицаЗначений"));
	Для каждого ИнфБаза Из ТаблицаБаз Цикл
		ИнформационнаяБаза = ИнфБаза.База;
		Сервер = ИнформационнаяБаза.Сервер;
		ИмяБазы = ИнформационнаяБаза.ИмяФайла;
		
		ДанныеПодключенияККластеру = ОбщегоНазначенияСервер.ВыполнитьПодключениеККластеруСерверов(Сервер);
		РабочийПроцесс = ДанныеПодключенияККластеру.СоединениеСРабочимПроцессом;
		МассивБаз = РабочийПроцесс.GetInfoBases();
		
		Для каждого База Из МассивБаз Цикл
			Если База.Name = ИмяБазы Тогда
				БазаВКластере = База;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		БазаВКластере.DeniedFrom = ВремяНачала;
		БазаВКластере.DeniedTo = ВремяОкончания;
		БазаВКластере.DeniedMessage = "Проводятся регламентные работы с " + ВремяНачала + " до " + ВремяОкончания; 
		БазаВКластере.ConnectDenied = УстановкаСнятиеБлокировки;
		БазаВКластере.ScheduledJobsDenied = БлокировкаРегламентныхЗаданий;
		БазаВКластере.PermissionCode = КодРазрешения;
		//БазаВКластере.Descr = ИнформационнаяБаза.Комментарий;
		//РабочийПроцесс.DropInfoBase(БазаВКластере, 0);
		//НоваяБаза = РабочийПроцесс.CreateInfoBaseInfo();
		//ЗаполнитьЗначенияСвойств(НоваяБаза, БазаВКластере);
		//НоваяБаза.Descr = ИнформационнаяБаза.Комментарий;
		//НоваяБаза.Locale = "RU";
		//НоваяБаза.dbPassword = "1A2S3d4f";
		//НоваяБаза = РабочийПроцесс.CreateInfoBase(НоваяБаза, 0);
		РабочийПроцесс.UpdateInfoBase(БазаВКластере);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	
	Если Форма.УстановкаСнятиеБлокировки Тогда
		Элементы.ФормаУстановитьБлокировку.Заголовок = "Установить блокировку";
	Иначе
		Элементы.ФормаУстановитьБлокировку.Заголовок = "Снять блокировку";
		Элементы.ГруппаДанныеБлокировки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеФормой()

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	ВремяОкончания = ВремяНачала + 30*60;
КонецПроцедуры
