
Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияСтандартная = Истина;
		НовыйПользователь.Имя = ИмяДляВхода;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовыйПользователь.Записать();
		ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		ПользовательИБ.Имя = ИмяДляВхода;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Записать();
	КонецЕсли;

КонецПроцедуры
