
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура SQLПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ПрочиеОбработчики

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.Сервер.Видимость	= Объект.SQL;
	Элементы.ИмяФайла.Видимость	= Объект.SQL;
	Элементы.Адрес.Видимость	= НЕ Объект.SQL;
	
КонецПроцедуры // УправлениеФормой()

#КонецОбласти
