
Процедура УстановитьВыполнениеОперации(ИнформационнаяБаза, ВыполняемаяОперация) Экспорт 

	МенеджерЗаписи = РегистрыСведений.ВыполняемыеОперацииСИнформационнымиБазами.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИнформационнаяБаза = ИнформационнаяБаза;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ИнформационнаяБаза = ИнформационнаяБаза;
		МенеджерЗаписи.Операция = ВыполняемаяОперация;
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗавершениеВыполненияОперации(ИнформационнаяБаза, ВыполняемаяОперация) Экспорт 
	НаборЗаписей = РегистрыСведений.ВыполняемыеОперацииСИнформационнымиБазами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	НаборЗаписей.Отбор.Операция.Установить(ВыполняемаяОперация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры
