
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ПроверкаГруппы(ВыбраннаяСтрока) Тогда 
		Возврат;
	КонецЕсли;
	Ответ = Вопрос("Да - Подключиться, Нет - Редактировать", РежимДиалогаВопрос.ДаНетОтмена, 60);
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтандартнаяОбработка = Ложь;
		СписокВыборНаСервере(ТекущиеДанные);
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	Иначе 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	////--------------------Открытие диалога ДаНетОтмена без применения модальных окон
	//ОписаниеОповещения = Новый ОписаниеОповещения("ВводТекстаЗаврешение", ЭтаФорма);
	//ОткрытьФорму("Справочник.Пользователи.Форма.ФормаДаНетОтмена",,,,,,ОписаниеОповещения);
	////--------------------
КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере(ТекущиеДанные)
	//Подключиться.ПодключитьсяКСерверу(ТекущиеДанные);
	//Возврат;
КонецПроцедуры

&НаСервере
Функция  ПроверкаГруппы(Стр)
	Возврат Стр.ЭтоГруппа;
КонецФункции

//функиця для открытия диалога ДаНетОтмена без применения модальных окон
//Функция ВводТекстаЗаврешение(Результат, Параметры) Экспорт 
//	Если Не Результат = Неопределено Тогда 
//		ВведенныйТекст = Результат;
//	КонецЕсли;
//КонецФункции
